#define _CRT_SECURE_NO_WARNINGS
#include<windows.h>
#include<stdio.h>

/////// for循环 //////
//for循环​
//​适用场景​：
//循环次数已知（如遍历数组、固定次数的迭代）
//需要集中管理循环变量（初始化、条件、迭代在同一行）
//典型用例：遍历列表、生成数字序列、多维数组处理

//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
////for括号内第一个为初始化部分，第二个是条件判断部分，第三个是调整部分
////如果有continue的话会直接跳到第三个调整部分
////建议for语句的循环控制变量的取值采取前闭合后开区间的写法（如后面写<10而不是<=9）
//	{
//		printf("%d ", i);
//		printf("rem\n");
//		//这里一样如果要一起打印就要用大括号括起来
//		//就一个条件的话可以不用加
//	}
//	return 0;
// }           //------for循环经典式子-------
///////////////////////////////////////////////////////////////////////////////////////
//
//int main()
//{
//	for (;;)
//	{
//		printf("rem\n");
//	}
//	return 0;
//}
//                          //for循环的判断部分省略意味着这判断会恒成立
//						  // 结果是死循环
///////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int i = 0;
//	int j = 0;
//
//	for (; i < 3; i++)
//		//局部变量优先，全局变量里ij赋值一次之后到了for循环，没结束for循环时都以for循环里的变量优先
//		//因为j的赋值行为出现在for循环的外面，所以j只会被赋值一次，经过加价之后就不符合循环的判断条件了
//		//这里可以理解为j循环了3次
//	{
//		for (; j < 3; j++)
//
//		printf("rem\n");
//	}
//	return 0;
//}    //如果初始化部分打了就是 3*3=9
///////////////////////////////////////////////////////////////////////////////////////

            //不能写	for (int i = 0; i < 3; i++)这种形式
            //因为只有从c99语法才支持这种，c++也支持
            //所以只写i = 0这种形式就好了
            
///////////////////////////////////////////////////////////////////////////////////////
             
             //如果for里的条件判断部分变成i=0等写法，这循环0次
             //因为i被赋值为0，0为假，所以不进行循环

///////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////

                       //do while循环

///////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////
//练习


//1.求1！+2！+ ....+10！
//int main()
//{
//    int i = 0;
//    int n = 0;
//    int ret = 1;
//    int c = 0;
//
//    for (n = 1; n<=3; n++)
//    {
//        ret = 1;//加上这个就对了 ps:int可加可不加
//        for (i = 1; i <= n; i++)
//        {
//            ret = ret * i;  //这里ret没有初始化，第二次不是1而是2，所以错误
//        }
//        c = c + ret;
//
//    }
//
//    
//    printf("%d\n", c);
//
//    return 0;

//}
        //但是这个还是繁琐了

//        //这个是简易版
//int main()
//{
//    int i = 0;
//    int n = 0;
//    int ret = 1;
//    int c = 0;
//     
//    for (n = 1; n <= 10; n++)
//    {
//        ret = ret * n;
//        c = c + ret;
//    }
//    printf("%d\n", c);
//    return 0;
//}
///////////////////////////////////////////////////////////////////////////////////////

////2.（数组中）查找目标
////        ！！ 二分法很高效！！（前提条件是数组要有序）
//
//int main()
//{
//    int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//    int k = 7;
//    int sz = sizeof(arr) / sizeof(arr[0]);//注意括号的用法
//
//    int left = 0;
//    int right = sz - 1;
//
//    while ( left <= right)//这里一定要=不然最后等于哪里不去考虑就会得不到结果。
//    {
//        int mid = left + (right - left) / 2;
//        //int mid = (left + right) / 2;//这行代码放到while循环外会陷入死循环，
//                                     //因为min的值在循环外仅计算一次，后续循环中不再更新
//
//        if (arr[mid] < k)
//        {
//            left = mid + 1;//
//        }
//        else if (arr[mid] > k)
//        {
//            right = mid - 1;//
//        }
//        else
//        {
//            printf("找到了，下标是：%d\n", mid);//
//            break;//
//        }       
//    }
//    if (left > right)
//    {
//        printf("找不到，果咩\n");
//    }//
//
//    return 0;
//}
///////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//    char arr1[] = "I love you, Rem.";
//    //            "I love you, Rem.\0";
//    char arr2[] = "################";
//
//    int left = 0;
//    int right = strlen(arr1) - 1;
//              //strlen求的是字符串长度，不包含\0，最末位元素下标本身就要减1
//              //sizeof求的是空间的大小，包含\0，所以要再减1(就是要减2）
//    while (left <= right)
//    {
//        arr2[left] = arr1[left];
//        arr2[right] = arr1[right];
//
//        printf("%s\n", arr2);
//
//        Sleep(300); //这个符号是用来代表休眠的多少毫秒
//        system("cls");
//                       //cls是系统命令，意思是清空屏幕
//                       //system是库函数用来执行系统命令
//        left++;
//        right--;
//
//    }
//    printf("%s\n", arr2);
//
//    return 0;
//}
///////////////////////////////////////////////////////////////////////////////////////
//只允许输入三次密码：
 
//int main()
//{
//    int i = 0;
//    char password[20] = { 0 };
//    
//    for (i = 0; i < 3; i++)
//    {
//        printf("Please scanf your secret:>");
//        scanf("%s", password);
//                     //数组名本来就是地址不需要再取地址
//                     //如password，scanf（“%s”， password）里的passwoed不用加&
//        if (strcmp(password, "Raphtaria") == 0)
//                     //比较两个字符串是否相等，不能用==，而应该用一个库函数strcmp
//                     //如果返回值是0；表示两个字符串相等。
//                     //要引进头文件 #include<string.h>
//        {
//            printf("Successful landing\n");
//            break;
//        }
//    }
//        if (i == 3)
//        {
//            printf("Fault\n");       
//        }
//    
//    return 0;
//}

//int main()
//{
//    int i = 0;
//    char password[20] = { 0 };
//
//    while (i < 3)
//    {
//        printf("Please scanf your secret:>");
//        scanf("%s", password);
//
//        if (strcmp(password, "Raphtaria") == 0)
//        {
//            printf("Successful landing\n");
//            break;
//        }
//        i++;
//    }
//    if (i == 3)
//    {
//        printf("Fault\n");
//    }
//    return 0;
//}
//
//            

 