#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


//标准的整型变量（int,  short , long 等）只用于存储整数，不直接包含字母或其他字符
//字符（英文字母、符号等）​​ 是由 ​**char 类型**​ 来表示的，虽然它在技术上也属于整型范畴，但用途和语义上有明确区分
//​整型​（Integer Types）是用于表示整数的数据类型，它不包含英文字母或其他字符。
// 整型变量专门用来存储没有小数部分的数值，例如 10、-5、0、1024 等 




//int main()
//{
//	int a = 10;
//	if ( a = 3)  //没有 ‘ ; ’。
//  // 只要if括号里面的是真函数，一定能运行出来。
//
//  //若是if ( a == 3)就不能打印出来，因为==是判断的，与之前的相反，是假的。
//
//		printf("hehe\n");
//
//	return 0;
//}
//
////ctrl+x剪切
//
/////////////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//
//	int age = 10;
//	scanf("%d", &age);
//
//	if (age < 18)
//		printf("small\n");
//
//	//else if (18 <= age < 28) 
//	// ⬆⬆⬆⬆⬆ 不能这样写！⬆⬆⬆⬆⬆
//	//因为18 <= age为假，所以结果为0；0＜28结果为真，所以打印
//
//	else if (age>=18 && age<28)
//    // 用&&表示并且连接。
//    //还有就是else if不用大括号的话默认只带后面一条表达式，想多条就用{}框起来
//
//    //else if
//	//else if
//	// ........
//	//else 	
//
//
//		printf("formal\n");
//
//	return 0;
//
//}
/////////////////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int a = 0;
//	int b = 2;
//	if (a == 1)       //没有{}的情况下if只跟下一个条件式相关联
//		if (b == 2)
//			printf("Rapftaria\n");
//		else      //这里的else只跟着上一个if，无论位置在哪，位置对齐好方便看(❤ ω ❤)
//			printf("Rem\n");
//	return 0;     //这里打印不出来是因为第一个if不成立，导致下一个if执行，也使得跟着第二个if的else不执行。
//	
//}
//int main()
//{
//	int a = 0;
//	int b = 2;
//	if (a == 1)
//	{
//		if (b == 2)
//			printf("Rapftaria\n");
//	}
//	else
//		printf("Rem\n");
//
//	return 0;   //这样加个 {} 就可以运行成功了  b（￣▽￣）d　
//}
/////////////////////////////////////////////////////////////////////////////////////////////////
//int main()
//{
//	int num = 3;
//
//	//if (num == 5)      /////  大错误(╯▔皿▔)╯  ////////
//    //因为当少填一个=的时候因为语法没问题，所以还是能运行成功，这样的话有时候会出现bug
//	// num赋值了5进去，所以这个式子是真，能运行
//	    //所以最好的方法就是--------------
//	if (5 == num)
//	//这样少了 = 会警告，可以避免错误 o(*￣▽￣*)ブ
//
//		printf("rem\n");
//
//	return 0;
//}


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//switch//

//int main()
//{
//	int day = 0;
//	scanf("%d", &day);
//
//	switch (day) //()内一定是int整形，不能用浮点形【整形常量】
//		//switch 也不用加‘ ；’
//	{
//	case 1:
//		printf("rem\n");
//		break;  //--------> 如果不加break就会不退出执行下面的式子
//	case 2:
//		printf("raphtaria\n");
//		break;
//
//	//............
//		//break;
//	
//
//    //若输入负数等错误值，用default
//	//表示若输入值不在上面case所给范围就都来到这里执行
//	default:
//		printf("fault\n");
//		break;
//
//	}
//
//	return 0;
//}
//////////////////////////////////////////////////////////////////////////

//    //例题
//int main()
//{
//	int n = 1;
//	int m = 2;
//	switch (n)
//	{
//
//	case 1:m++; //这里的case后面的数表示的是switch括号里的数，如果n初始是2则直接进入case2不进行case1
//	case 2:n++;
//	case 3:
//		switch (n)
//		{
//		case 1: n++;         //最左边的case因为没break所以一直运行下去
//		case 2: m++; n++;    
//			break;
//		}    //这里只是第三个大case结束了，第四个还是会运行
//	case 4:
//		m++;
//		break;
//	default:
//		break;
//
//	}
//	printf("m = %d, n = %d\n", m, n);
//	return 0;
//}
////////////////////////////////////////////////////////////////////////////////////
//
//int main()
//{
//	int i = 1;
//	while (i <= 10)
//	{
//		i++;
//		if (5 == i)
//			continue;  //continue 的作用是跳过本次循环后面的代码，进行下一次重复的循环
//		               
//
//		printf("%d ", i);//想要打印出来有间隔就可以在 “ ” 加空号。
//		
//	}
//
//	return 0;
//}
/////////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
////
////	//int ch = getchar();
////	//getchar 可以获得个字符，把那个获取的字符的asmaL值放到ch里
////	//printf（"%c\n"，ch）；
////	// putchar (ch);
//
//    int ch = 0;
//	while((ch = getchar()) != EOF)
//		// eof 是结東标准，所以当输入值等于负一时（检查到负一时）就结束循环
//		//!=这是一个比较操作，检查!= 后面 的那个值是否不等于 控制室里 输入的值
//      //当！= 检测到了后面的值则循环结束
//		//其实输什么都不会结東因为ascall值1-127没有负一（即一直把输入的全打印出来）（包括enter键）
//	{
//		putchar(ch);
//    //putchar每次只能读取一个字符，可以通过调试监控去观察
//	//可以想成把输入的结果放入缓存区，getchar一个一个把他们取出来
//	//enter键在这里其实代表 /n （换行），所以在结果会变到下一行。
//  
//
//	}
//		return 0;
//	
//}

//////////////////////////////////////////////////////////////////////////////////////////////
//
//int main()
//{
//	char password[20] = { 0 };
//	printf("请输入密码:>");
//	scanf("%s", password);//这个只会拿走非整形前的整形，如拿走REM ABC里的REM，后面不要了
//		
//	//getchar();
//	//这里如果不用这个getchar，那么当输入的有空格等不是整形的符号时就会默认跳到else里
//	//但是这个表达式很简陋！因为当输入的是 abc_REM \n (\n是enter键)这种非字符后还有多个数时，只是拿走一个数，结果还是NO 
//	//所以正确来说应该改一个循环函数：
//	int ch = 0;
//	while ((ch = getchar()) != '\n')
//	{
//		;
//	}
//
//	printf("请确认输入密码(Y/N):>");
//
//	int ret = getchar();//int ret 声明了一个名为 ret 的变量，用于存储整数（integer）值。
//	//这里，ret 的作用是临时保存 getchar() 函数 的返回值**，也就是用户输入字符的 ASCII 码值
//
//	if ('Y' == ret)
//	{
//		printf("YES\n");
//	}
//
//	else
//	{
//		printf("NO\n");
//	}
//
//	return 0;
//
//}
//
////**不用浪费时间在scanf ，printf上工作少用**
//////////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//	char ch = '\0';  //这里的‘ \0’也可替换成0，代表初始化
//	//'\0' 是 C 语言中表示 ​​“这是一个空字符”​​ 的标准方式，而 0 是 ​​“这是一个整型零”​。虽然结果相同，但前者让代码自解释性更强，降低团队协作成本。
//	
//	while ((ch = getchar()) != EOF)
//	{
//		if (ch < '0' || ch > '9')  // ‘||’是或者的符号
//			//这里的0-9其实是ASCII值，即不是0-9的都会进入continue不会打印
//			continue;  //continue的作用是跳过后面函数直接进入到下一个循环，这里运行就代表着不会putchar（打印）
//		putchar(ch);
//	}
//	return 0;
//}
///////////////////////////////////////////////////////////////////////////////////////////////////

////题目：转换ASCII值
//int main()
//{
//	int arr[] = { 73, 32, 99, 97, 110, 32, 100, 111, 32, 105, 116, 33 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]); //sz得出的是元素个数
//	//sizeof 用于查询对象或类型所占用的内存大小（以字节为单位）
//	//sizeof(arr)计算的是数组的总大小，单位是字节
//	//sizeof(arr[0])计算的是数组元素的大小
//
//	while (i < sz)
//	{
//		printf("%c", arr[i]);
//		i++;
//	}
//	return 0;
//}
////////////////////////////////////////////////////////////////////////////////////////////////////////
//题目：输入输出生日
//int main()
//{
//	int year = 0;
//	int month = 0;
//	int date = 0;
//	scanf("%4d%2d%2d", &year, &month, &date);
//	//scanf不说明的情况下只读取一个数值
//	//4%表示的是读4位整数，以此类推
//
//	printf("year=%d\n", year);
//	printf("month=%02d\n", month);
//	//这里的02d的2表示要打印两位，0表示没有两位就补一个零。
//	printf("date=%02d\n", date);
//
//	return 0;
//	
//}
//////////////////////////////////////////////////////////////////////////////////////////////////

//float c = 0;
//float c = 0.0f;
//这里的0.0就被认为是double类型的，后面还要加个f代表这个值是float类型的
//double是一种双精度浮点数数据类型，用于存储高精度的实数（带小数点的数值）

//float和double都是用于储存，但是double 比 float ​多一倍内存，大量数据时需权衡
//低精度用float，高精度用double

//若用double
//// 输入scanf​​：%lf必须严格用于 double，若误用 %f 会导致数据截断或崩溃（double 为8字节，%f 仅读取4字节）。
​////输出printf​​：%lf和%f效果相同，但为代码一致性，建议统一用%lf
////简单记：double都用%lf

//注意：二进制无法精确表示某些十进制小数（如 0.1），导致微小误差
//如：double a = 0.1 + 0.2;     / 实际值 ≈0.30000000000000004
///////////////////////////////////////////////////////////////////////////////////////////////////

//题目：打印输出后的返回值
//int main()
//{
//	int n = printf("Hello world!");
//	//可以再上面末尾加\n代表换行，但是换行的\n也代表一个符号，几返回值12变成了13
//
//	//所以可以在输出前加来换行
//	printf("\n%d\n", n);
// 
//	return 0;
// 
//}
////////////////////////////////////////////////////////////////////////////////////////////////
;
//int sum(int a)
////此处函数实际行为是“状态依赖的累加”​​ ——> a + 动态变化的 b + 固定 c
//{
//	int c = 0;
//	static int b = 3;
//	//static修饰局部变量使其出函数值保留不变
//	c += 1;
//	// += 的意思是先计算后赋值
//	b += 2;
//	return (a + b + c);
//}
//
//int main()
////在C语言中，程序执行入口由编译器和操作系统严格约定，必须从main函数启动
//{
//	int i;
//	int a = 2;
//	for (i = 0; i < 5; i++)//0，1，2，3，4共5次输出
//	{
//		printf("%d,", sum(a));
//	}
//}
//////////////////////////////////////////////////////////////////////////////////

//想要打印 printf("hell world\n")的话
   //   printf("peintf(\"hello world!\\n\");\n");
//这里的"和\n前面都要加上\，表示转义
////////////////////////////////////////////////////////////////////////////////////
//题目：求输入4个值里的最大值
//
//  //第一种
// 
//int main()
//{
//
//	   //这里是先把输入的值先放到数组里后面再进行比较大小
//	int arr[4] = { 0 };
//	   //{ 0 }是一个初始化列表，用于在定义数组时给元素赋初值
//	   //   ！！大括号 {} 在数组初始化中必须使用！！
//	   //这里的0表示第一个元素（arr[0]）被显式赋值为0
//	int i = 0;
//	while (i < 4)
//	{
//		scanf("%d", &arr[i]);
//		i++;
//	}
//
//	    //假设第一个元素就是最大值
//	int max = arr[0];
//	i = 1;
//	while (i < 4)
//	{
//		if (arr[i] > max)
//		{
//			max = arr[i];
//		}
//		i++;
//	}
//	printf("%d\n", max);
//
//	return 0;
//}

////第二种
//
//int main()
//{
//	int i = 0;
//	int n = 0;
//	int max = 0;
//
//	scanf("%d", &max);
//
//	while (i < 3)
//	{
//		scanf("%d", &n);
//		if(n>max)       //if如果没有别的分支那么直接写在后面就好了
//			max = n;
//		i++;
//	}
//	printf("%d\n", max);
//
//	return 0;
//}
//
//
////PS：找最大值就是通过循环一个一个筛选出然后得出最大的！

//////////////////////////////////////////////////////////////////////////////////////////
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//	
//	float c = a / (b / 100.0) / (b / 100.0);
//	// b/100​：整数除法（如 175/100 = 1）→ ​身高被错误计算为 1m（实际是 1.75m）
//	//b/100（整数除法）会丢失精度,舍弃小数部分（截断），如 {175 / 100 = 1} 
//	//操作数中至少有一个是浮点数（如 100.0），则整数会被自动转换为浮点数，结果保留小数（多位）。
//		printf("%.2f\n", c);
//
//	return 0;
//}
///////////////////////////////////////////////////////////////////////////////////////////

//ps：i++指的是每次循环加一， i+=n指的是每次循环加n


/////////////////////////////////////////////////////////////////////////////////////////
//第一小部分结束  \^o^/