#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//
//int main()
//{
//	char name[6][21];
//	float ave[6];
//	int i, j;
//	int max = 0;
//
//	for (j = 0; j < 5; j++)
//	{
//		scanf("%s", &name[j]);
//
//		float sum = 0;
//		float score;
//
//		for (int k = 0; k < 5; k++)
//		{
//			scanf("%f", &score);
//			sum += score;
//		}
//		ave[j] = sum / 5.0f;
//	}
//
//	for (i = 0; i < 5; i++)
//	{
//		if (ave[i] > ave[max])
//		{
//			max = i;
//
//		}
//	}
//
//	printf("%s %.2f", name[max], ave[max]);
//
//	return 0;
//}

/////////////////////////////////////////////////////////////////////////////////////////////
//
//#include<string.h>
//int main()
//{
//	char country[11][21];
//	int n = 0;
//
//	for (int i = 0; i < 10; i++)
//	{
//		scanf("%s", country[i]);
//		//country[i] 本身就是字符数组的首地址，无需加& 
//	}
//
//	//for (int j = 0; j < 10; j++)
//	//{
//	//	for (int k = 'A'; k <= 'Z'; k++)
//	//	{
//	//		int m = country[n][0];
//	//		if ('m' == k)
//	//		{
//	//			printf("%s", country[n]);
//	//			printf("\n");
//	//			n++;
//	//		}
//	//	}
//	//}
//
//	for (int i = 0; i < 9; i++)
//		//总共需要 n-1 轮循环（10 个元素需要 9 轮）,倒数第二小放在1，这0就已经确认了
//	{
//		for (int j = 0; j < 9 - i; j++)
//		{
//			if (strcmp(country[j], country[j + 1]) > 0)
//				//strcmp按字典顺序（ASCII 码值）比较两个字符串的大小
//				//str1的字典序大于str2返回正数,等于返回0；小于返回负数
//			{
//				char temp[21];
//				strcpy(temp, country[j]);
//				strcpy(country[j], country[j + 1]);
//				strcpy(country[j + 1], temp);
//
//			//trcpy 函数：字符串复制
//			//功能：将源字符串（包括结束符 '\0'）复制到目标字符串中，覆盖目标字符串原有内容
//			//第一个是存储复制后的内容；第二个是用于复制的内容
//			}
//		}
//	}
//
//	for (int i = 0; i < 10; i++)
//	{
//		printf("%s\n", country[i]);
//	}
//
//	return 0;
//}
/////////////////////////////////////////////////////////////////////////////////////////////

//	字符串的比较不是直接比较整个字符串的内容，而是按字符逐个比较它们的 ASCII 码值
//	直到遇到第一个不同的字符或字符串结束标志 \0 为止
//int main()
//{
//	char s1[21];
//	char s2[21];
//	int j = 0;
//
//	fgets(s1, sizeof(s1), stdin);
//	fgets(s2, sizeof(s2), stdin);
//
//	//fgets会包含换行符，需处理
//	while (s1[j] != '\0')
//	{
//		if (s1[j] == '\n')
//		{
//			s1[j] = '\0';
//			break;
//		}
//		j++;
//	}
//	j = 0;
//
//	while (s1[j] != '\0')
//	{
//		if (s1[j] == '\n')
//		{
//			s1[j] = '\0';
//			break;
//		}
//		j++;
//	}
//	j = 0;
//
//	//for (j = 0; s1[j] != '\0'; j++)
//	//{
//	//	if (s1[j] > s2[j])
//	//	//s1[i] > s2[j] 的比较本质是两个字符的 ASCII 码值大小比较
//	//	{
//	//		printf("%d", s1[j] - s2[j]);
//	//		s1[j] = '\0';
//	//		break;
//	//	}
//
//	//	else if (s1[j] < s2[j])
//	//	{
//	//		printf("%d", s1[j] - s2[j]);
//	//		s1[j] = '\0';
//	//		break;
//	//	}
//
//	//	else if (s1[j] == s2[j])
//	//	{
//	//		printf("0");
//	//	}
//	//}
//
//	while (s1[j] != '\0' && s2[j] != '\0')
//	{
//		if (s1[j] != s2[j])
//		{
//			printf("%d", s1[j] - s2[j]);
//			return 0;
//		}
//		j++;
//	}
//
//	printf("0");
//
//	return 0;
//}
/////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int n;
//	scanf("%d", &n);
//	char arr[1000];
//
//	for (int i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//
//	int qwq[1000];
//	for (int j = 0; j < n; j++)
//	{		
//		qwq[n - j] = arr[j];
//	}
//
//	for (int k = 1; k <= n; k++)
//	{
//		printf("%d ", qwq[k]);
//	}
//
//	return 0;
//}
/////////////////////////////////////////////////////////////////////////////////////////////


//int main()
//{
//	int i, num, count = 0, sum = 0;
//
//	for (i = 0; i < 10; i++)
//	{
//		scanf("%d", &num);
//		if (num < 0)
//			continue;
//		sum += num;
//		count++;
//	}
//	printf("count=%d\n sum=%d\n", count, sum);
//	return 0;
//}\

/////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int x, t, s1, s2, s3;
//	scanf("%d", &x);
//	t = 100;
//	while (t <= x)
//	{
//		s1 = t / 100;
//		s2 = (t / 10) % 10;
//		s3 = t % 10;
//		if (20 == s1 + s2 + s3)
//			printf("%d\n", t);
//		t++;
//	}
//	return 0;
//}
 
 
/////////////////////////////////////////////////////////////////////////////////////////////

//main()
//{
//	int x, y;
//	scanf("%d", &x);
//	if (x >= 0)
//		if(x == 0)
//		y = 0;
//	else
//		y = 1;
//   else
//	   y = -1;
//	   printf("%d", y);
//}

/////////////////////////////////////////////////////////////////////////////////////////////


//int main()
//{
//	int i;
//	double n = 1, total = 1;
//	i = 0;
//	while (i < 64)
//	{
//		n = n * 2;
//		total += n;
//		i++;
//	}
//	printf("total=%22.6e\n", total);
//	return 0;
//}

/////////////////////////////////////////////////////////////////////////////////////////////
//	  *
//	 ***
//  *****
// *******
//*********

//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//
//	if (3 <= n && n <= 20)
//	{
//		for (int i = 1; i <= n; i++)
//		{
//			for (int j = 1; j <= n - i; j++)
//			{
//				printf(" ");
//			}
//
//			for (int k = 1; k <= (i-1)*2 + 1; k++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}

/////////////////////////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int n, x, y;
//	scanf("%d %d %d", &n, &x, &y);
//
//	if (y <= n * x)
//	{
//		if (y % x != 0)
//		{
//			n = n - 1 - y / x;
//		}
//
//		else
//		{
//			n = n - y / x;
//		}
//
//		printf("%d", n);
//	}
//	return 0;
//}

/////////////////////////////////////////////////////////////////////////////////////////////

int main()
{
	int n;
	char m;
	scanf("%d %c", &n, &m);

	if (n <= 1000)
	{
		if (m == 'y')
		{
			printf("13");
		}
		else
		{
			printf("8");
		}
	}
	else
	{
		if (m == 'y')
			//这里的 m 和带 '' 的字符常量（如 'y'）在比较时，都会以 ASCII 码值的形式参与运算
			// C 语言会自动将字符转换为对应的 ASCII 码值进行比较
		{
			if ((n - 1000) % 500 != 0)
			{
				int k = ((n - 1000) / 500) + 1;
				printf("%d", 13 + 4 * k);
			}
			else
			{
				int p = ((n - 1000) / 500);
				printf("%d", 13 + 4 * p);
			}
		}
		else
		{
			if ((n - 1000) % 500 != 0)
			{
				int k = ((n - 1000) / 500) + 1;
				printf("%d", 8 + 4 * k);
			}
			else
			{
				int p = ((n - 1000) / 500);
				printf("%d", 8 + 4 * p);
			}
		}
	}
	return 0;
}