#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//编写一个函数递归实现将参数字符串中的字符反向排列，不是逆序打印
//
//int my_strlen(char*str)
////*str传递的是字符串的首地址
//{
//	int n = 0;
//	while (*str != '\0')
//	{
//		n++;
//		str++;
//	}
//	return n;
//}
//
//void reverse(char arr[], int left, int right)
//{
//	char tmp = arr[left];
//	arr[left] = arr[right];
//	arr[right] = tmp;
//	if (left < right)
//	{
//		reverse(arr, left + 1, right - 1);
//	}
//}
//
//
//
//int main()
//{
//	char arr[100] = { 0 };
//	    //char arr[] = {0} 定义了一个长度为 1 的字符数组（仅能存储'\0'）,会导致数组越界
//		//应指定合理的数组长度
//	    //字符类型用char
//	scanf("%s", arr);
//	    //arr是字符数组名，在 C 语言中数组名本身就代表数组的首地址（类型为char* ），无需加& 取地址符
//	    //%c单个字符,%s字符串
//	int left = 0;
//	int right = my_strlen(arr) - 1;
//	reverse(arr, left, right);
//
//	printf("%s", arr);
//
//	return 0;
//}
//////////////////////////////////////////////////////////////

//int main()
//{
//	//逗号表达式
//	int arr[] = { 1, 2, (3,4), 5 };
//	    //这里的括号内最终只留下最后一个结果4，所以等效于为1，2，4，5
//	printf("%d\n", sizeof(arr));
//	return 0;
//}
//////////////////////////////////////////////////////////////

//ps:arr[n]也算是一个类型

//////////////////////////////////////////////////////////////

//int main()
//{
//	int arr[2][3] = { 1,2,3,4,5,6 };
//	//值为4的是a[1][0]
//	//因为ar[2][3]表示两行三列，但是计算却是以arr[0][0]开始 的
//}

//////////////////////////////////////////////////////////////

//int a[2][4] = { {0,1,2}, {3,4}, {5} };//错误
//在 C 语言中，二维数组初始化时，内层初始化列表的数量必须与数组第一维的大小一致
//{}内的{}指的是该行的个数，所以上面的{5}为第三行超出了范围
//也不能{1，，2}，初始化列表中不能使用连续的逗号（,,）来表示跳过元素，但可以{}

//////////////////////////////////////////////////////////////
////交换两个数组的数
//int main()
//{
//	int arr1[] = { 1,2,3,4,5 };
//	int arr2[] = { 6,7,8,9,0 };
//
//	//int tmp[] = { 0 };
//	//tmp = arr1;
//	//arr1 = arr2;
//	//arr2 = tmp;
////错误
////可以一个一个换，但不能整个换，整个换就是地址，换不了
//	int i = 0;
//	int sz = sizeof(arr1) / sizeof(arr1[0]);
//	for (i = 0; i < sz; i++)
//	{
//		int tmp = arr1[i];
//		arr1[i] = arr2[i];
//		arr2[i] = tmp;
//	}
//
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr1[i]);
//	}
//	printf("\n");
//
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr2[i]);
//	}
//	printf("\n");
//} 
//////////////////////////////////////////////////////////////
//
//void init(int arr[], int sz)
//{
//	int i = 0;
//	for (i = 0; i < 0; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//}
//////////////////////////////////////////////////////////////

//vs里不支持arr[n]数组大小变量