#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int count = n;
//
//	for (int i = 1; i <= n; i++)
//	{
//		
//		for (int j = 1; j <= n - i; j++)
//		{
//			printf(" ");
//		}
//		count--;
//		for (int k = 1; k <= n - count; k++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	return 0;
//}
// *
// **
// ***
/////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int num = 0;
//	int m = 1;
//	for (int i = 1; i <= n; i++)
//	{
//		num++;
//		for (int k = 1; k < num; k++)
//		{
//			printf(" ");
//		}
//
//
//		for (int j = 1; j <= 2*n - m; j++)
//		{
//			printf("*");
//		}
//		m++;
//		m++;
//		printf("\n");
//
//	}
//
//	return 0;
//}
//*****
// ***
//  *
/////////////////////////////////////////////////////////////////////////

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int num1 = n / 2;
//	int num2 = 1;
//	int num3 = 1;
//	int num4 = (n + 1) / 2;
//
//	if (n % 2 != 0)
//	{
//		for (int j = 1; j <= (n + 1) / 2; j++)
//		{
//			for (int j = 1; j <= num1; j++)
//			{
//				printf(" ");
//			}
//			num1--;
//
//
//			for (int k = 1; k <= num2; k++)
//			{
//				printf("*");
//			}
//			num2++;
//			num2++;
//
//			printf("\n");
//		}
//
//		for (int j = 1; j <= n / 2; j++)
//		{
//			for (int k = 1; k <= num3; k++)
//			{
//				printf(" ");
//			}
//			num3++;
//
//			for (int j = 1; j <= num4; j++)
//			{
//				printf("*");
//			}
//			num4--;
//			num4--;
//
//			printf("\n");
//		}
//
//	}
//	return 0;
//}

/////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////
//
//int main()
//{
//	char s1[21];
//	char s2[21];
//	int i;
//
//	for (i = 0; i < 20; i++)
//	{
//		s2[i] = getchar();
//
//		if (s2[i] == '\n' || s2[i] == '\0')
//		{
//			s2[i] = '\0';
//			break;
//		}
//	}
//
//	if (i == 20)
//	{
//		s2[i] = '\0';
//	}
//	
//	for (i = 0; ;i++)
//	{
//		s1[i] = s2[i];
//		if (s1[i] == '\0')
//		{
//			break;
//		}
//	}
//
//	for (i = 0; s1[i] != '\0'; i++)
//	{
//		printf("%c", s1[i]);
//	}
//
//	return 0;
//}
/////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////
//
//int main()
//{
//	char s1[21];
//	char s2[21];
//	//使用 scanf("%s", str) 或 fgets(str, size, stdin) 等函数读取字符串到字符数组时，
//	// 函数会自动在末尾添加 '\0'（前提是数组空间足够）
//	int i;
//
//	for (i = 0; i < 20; i++)
//	{
//		s1[i] = getchar();	
//		if (s1[i] == '\n' || s1[i] == '\0')
//		{
//			s1[i] = '\0';
//			break;
//		}
//	}
//
//	for (i = 0; i < 20; i++)
//	{
//		s2[i] = getchar();	
//		if (s2[i] == '\n' || s2[i] == '\0')
//		{
//			s2[i] = '\0';
//			break;
//		}
//	}
//
//	for (i = 0; s1[i] != '\0'; i++)
//	{
//		if (s1[i] == '\n' || s1[i] == '\0')
//		{
//			break;
//		}
//		printf("%c", s1[i]);
//	}
//	for (i = 0; s2[i] != '\0'; i++)
//	{
//		if (s2[i] == '\n' || s2[i] == '\0')
//		{
//			break;
//		}
//		printf("%c", s2[i]);
//	}
//
//	return 0;
//}
//
/////////////////////////////////////////////////////////////////////////

//int main()
//{
//	char arr[4][81] = { 0 };
//	int upper = 0, lower = 0, digit = 0, space = 0, other = 0;
//	int i, j;
//
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 80; j++)
//		{
//			char c = getchar();
//			if (c == '\n' || c == EOF)
//			{
//				break;
//			}
//			arr[i][j] = c;
//		}
//		arr[i][j] = '\0';
//	}
//
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; arr[i][j] != '\0'; j++)
//		{
//			char c = arr[i][j];
//			if (c >= 'a' && c <= 'z')//这种是ASCLL码值；
//			{
//				lower++;
//			}
//			else if (c >= 'A' && c <= 'Z')
//			{
//				upper++;
//			}
//			else if (c >= '0' && c <= '9')
//			{
//				digit++;
//			}
//			else if (c == ' ')
//			{
//				space++;
//			}
//			else
//			{
//				other++;
//			}
//		}
//	}
//	printf("%d %d %d %d %d\n", upper, lower, digit, space, other);
//
//	return 0;
//}